def color(number):
    prefence_dict = {
        '1': 'Белый',
        '2': 'Жёлтый',
        '3': 'Зелёный',
        '4': 'Коричневый',
        '5': 'Красный',
        '6': 'Оранжевый',
        '7': 'Розовый',
        '8': 'Серый',
        '9': 'Синий',
        '10': 'Фиолетовый',
        '11': 'Чёрный'
    }
    return prefence_dict[number]

def music(number):
    prefence_dict = {
        '1': 'Авторская песня',
        '2': 'Альтернативная музыка',
        '3': 'Американа',
        '4': 'Блюз',
        '5': 'Дворовая музыка',
        '6': 'Джаз',
        '7': 'Жуткая музыка',
        '8': 'Классическая музыка',
        '9': 'Колыбельные',
        '10': 'Латино',
        '11': 'Латиноамериканская поп-музыка',
        '12': 'МУЗЫКА В ЖАНРЕ МЕТАЛЛ',
        '13': 'Летняя музыка',
        '14': 'Музыка в жанре АР-Н-БИ',
        '15': 'Музыка в жанре нью-эйдж',
        '16': 'Музыка в жанре нью-эйдж',
        '17': 'Музыка в жанре ретро',
        '18': 'Соул',
        '19': 'Сельская эстетика',
        '20': 'Музыка для детей',
        '21': 'Музыка для концентрации внимания',
        '22': 'Музыка из будки ди-джея',
        '23': 'Музыка мира',
        '24': 'Музыка ню-диско',
        '25': 'Музыка с острова',
        '26': 'Музыка эпохи барокко',
        '27': 'Поп-музыка',
        '28': 'Поп-музыка для детей',
        '29': 'Рождественская музыка',
        '30': 'Романтическая музыка',
        '31': 'С-поп',
        '32': 'Странные мелодии',
        '33': 'Хип - хоп',
        '34': 'Электронная музыка',
        '35': 'Японская народная музыка'
    }


    return prefence_dict[number]
def says(number):
    prefence_dict = {
        '1': '89263924622',
        '2': '89268850013',
        '3': '89264133783',
        '4': '89851344533',
        '5': '89181313242',
        '6': '89313351711',
        '7': '+7 (913) 979-68-52',
        '8': '7 919 401-05-55',
        '9': '7 (937) 132 15 20',
        '10': ' numberphone not found',
        '11': '7 (904) 676 26 14',
        '12': '7 (964) 634-23-58',
        '13': '7 (932) 534 35 40',
        '14': '+79853367971',
        '15': '7 (985) 286-79-51',
        '16': '7 (926) 386-45-85',
        '17': '89529293456',
        '18': 'numberphone not found'
    }
    return prefence_dict[number]

def theme(number):
    prefence_dict = {
        '1': '89263924622',
        '2': '89268850013',
        '3': '89264133783',
        '4': '89851344533',
        '5': '89181313242',
        '6': '89313351711',
        '7': '+7 (913) 979-68-52',
        '8': '7 919 401-05-55',
        '9': '7 (937) 132 15 20',
        '10': ' numberphone not found',
        '11': '7 (904) 676 26 14',
        '12': '7 (964) 634-23-58',
        '13': '7 (932) 534 35 40',
        '14': '+79853367971',
        '15': '7 (985) 286-79-51',
        '16': '7 (926) 386-45-85',
        '17': '89529293456',
        '18': 'numberphone not found'
    }
    return prefence_dict[number]

def fashion(number):
    prefence_dict = {
        '1': '89263924622',
        '2': '89268850013',
        '3': '89264133783',
        '4': '89851344533',
        '5': '89181313242',
        '6': '89313351711',
        '7': '+7 (913) 979-68-52',
        '8': '7 919 401-05-55',
        '9': '7 (937) 132 15 20'
    }
    return prefence_dict[number]


def hobby(number):
    prefence_dict = {
        '1': '89263924622',
        '2': '89268850013',
        '3': '89264133783',
        '4': '89851344533',
        '5': '89181313242',
        '6': '89313351711',
        '7': '+7 (913) 979-68-52',
        '8': '7 919 401-05-55',
        '9': '7 (937) 132 15 20',
        '10': ' numberphone not found',
        '11': '7 (904) 676 26 14',
        '12': '7 (964) 634-23-58',
        '13': '7 (932) 534 35 40',
        '14': '+79853367971',
        '15': '7 (985) 286-79-51',
        '16': '7 (926) 386-45-85',
        '17': '89529293456',
        '18': 'numberphone not found',
        '19': '89896283132',
        '20': '+7 962 951-43-21',
        '21': 'numberphone not found',
        '22': '7 983 215-58-89',
        '23': 'numberphone not found',
        '24': '+7 915-118-93-56',
        '25': '+79853367971',
        '26': '7 (985) 286-79-51',
        '27': '7 (926) 386-45-85',
        '28': '89529293456',
        '29': 'numberphone not found',
        '30': '89896283132',
        '31': '+7 962 951-43-21',
        '32': 'numberphone not found',
        '33': '7 983 215-58-89'
    }
    return prefence_dict[number]


def decor(number):
    prefence_dict = {
        '1': '89263924622',
        '2': '89268850013',
        '3': '89264133783',
        '4': '89851344533',
        '5': '89181313242',
        '6': '89313351711',
        '7': '+7 (913) 979-68-52',
        '8': '7 919 401-05-55',
        '9': '7 (937) 132 15 20',
        '10': ' numberphone not found',
        '11': '7 (904) 676 26 14',
        '12': '7 (964) 634-23-58',
        '13': '7 (932) 534 35 40',
        '14': '+79853367971',
        '15': '7 (985) 286-79-51',
        '16': '7 (926) 386-45-85',
        '17': '89529293456',
        '18': 'numberphone not found',
        '19': '89896283132',
        '20': '+7 962 951-43-21',
        '21': 'numberphone not found'
    }
    return prefence_dict[number]



